RU/Files/day_2_Ext/ggiExamples/mixerGgiParallelAmg/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="icoDyMFoam"

runApplication blockMesh
cp boundary constant/polyMesh
runApplication setSet -batch setBatch.setSet
runApplication setsToZones -noFlipMap
runApplication $application
